app/controllers/tasks_controller.rb

  def do_promise
    @promise = current_user.promise.build(:title => params[:title],:when => params[:when], :howlong => params[:howlong], :start => params[:start], :end => params[:end], :allDay => params[:allDay])
    if @promise.save
---
INSERT INTO "promises" ("question_id", "howlong", "created_at", "title", "updated_at", "end", "user_id", "start", "when", "allDay", "check") VALUES(NULL, NULL, '2010-08-30 13:30:23', 'ddd', '2010-08-30 13:30:23', '1282233600000', 14, '1282060800000', '', 't', NULL)

  def load_promise
    @promise = current_user.promise.all.to_json(:only=>[:title, :start, :end, :allDay])
---
SELECT * FROM "promises" ORDER BY promises.id DESC LIMIT 1