app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 5)