app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @title = "All users"
    @users = User.all

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "school_id", "email") VALUES('ml', '117e063c977d2a428f89df4aa0fb1c707fafd35a8014839fc6f89441092a9ab5', '6309a2d225cded0fc9b2f9ed8363e400960ac555561448d6b6206f8319463ce9', '2010-08-30 17:53:57', '2010-08-30 17:53:57', 'f', NULL, 333888, 'we@sma.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "updated_at" = '2010-08-12 15:23:27', "email" = 'japoon@haha.com', "encrypted_password" = '7009762bcb34a34341969acf3eb9ea74c0f9cd7d4abebcd1c0899803b71cb448', "salt" = '42c8428f4b9a14e9b3db28ba6ca27aae7a715876d8cd2f3a56c34a45fa3e5ef2', "name" = 'Eatt' WHERE "id" = 3
---
  def update
    if @user.update_attributes(params[:user])